Revit 2026 API

# ImageExportOptionsShadowViewsFileType Property

---

The file type for exported shadow views.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ImageFileType ShadowViewsFileType { get; set; }
```
```vb
Public Property ShadowViewsFileType As ImageFileType
	Get
	Set
```
```cpp
public:
property ImageFileType ShadowViewsFileType {
	ImageFileType get ();
	void set (ImageFileType value);
}
```
```fsharp
member ShadowViewsFileType : ImageFileType with get, set
```

#### Property Value

ImageFileType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default is JPEGMedium. This field is ignored if used to save an image to a project as a new view.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace